{"data_set_description": {"id": "43407", "name": "Advertising-Campaign-Analytics-Merkle-Sokrati", "version": "1", "description": "Problem Statement\nThe following Data Analysis of Marketing Campaigns is a part of the Assignment for Data Science Intern at Merkle Sokrati.\nObjectives of the Task\n\nCarry out EDA and build ML model to evaluate the insights automatically.\nPrepare a summary of your Analysis and put that into a professional looking deck.\n\nContent\nMarketing campaigns containing data from Oct19 to July20. This data is from Google and Facebook campaigns which shows the performance of different Age-groups for different dimensions.\nAll the key fields like Platform, Type, Medium, Sub Channel, Audience, Creative have already been mapped to the data.\n\nPlatform: Marketing platforms on which campaigns are running majorly: Google Ads and Facebook Ads.\nType: Type of campaign, In this data, only Google search and Facebook Conversion campaigns have been considered.\nMedium: The way we are connecting to people in our Marketing campaigns either via some Keywords or Creatives.\nSub Channel: Subchannel is under Google Search which type of keywords have been targeted, In Facebook which on subchannel we are targeting.\nAudience: Multiple Type of audiences are getting targeted in different campaigns and those have been encrypted as Audience 1,2,3.\nCreative: This if for Facebook what type of Image/Video/Carousel we are using in our Ads.\n\nAcknowledgements\nMerkle Sokrati has been sending these assignments for data analyst, data science intern positions and not replying back after the submission. So why not democratize my work and save other's time.", "description_version": "2", "format": "arff", "collection_date": "07-09-2020", "upload_date": "2022-03-23T13:12:29", "language": "English", "licence": "Database: Open Database, Contents: Database Contents", "url": "https://api.openml.org/data/v1/download/22102232/Advertising-Campaign-Analytics-Merkle-Sokrati.arff", "parquet_url": "https://openml1.win.tue.nl/datasets/0004/43407/dataset_43407.pq", "file_id": "22102232", "version_label": "v1.0", "tag": ["Computer Systems", "Machine Learning"], "visibility": "public", "minio_url": "https://openml1.win.tue.nl/datasets/0004/43407/dataset_43407.pq", "status": "active", "processing_date": "2022-03-23 13:12:40", "md5_checksum": "5a957402a6a8e2c13dcf8ee2e4d0278e"}}